#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    // 画像の読み込み
    // loadは読み込みをするための「関数」
    // 画像のファイル名など、関数に渡すパラメータを引数と呼ぶ
    img.load("test.png");
    
    ofBackground(0);
}

//--------------------------------------------------------------
void ofApp::update(){

}

//--------------------------------------------------------------
void ofApp::draw(){
    //ざっくりとした色の変更なども可能
    ofSetColor(255,0,0);
    img.draw(0,0);
    
    //for文。繰り返し処理
    // 初期化、条件式、iをいくつずつ増やしてループするか
    for(int i = 0; i < 5; i++){
        
        // 色の管理クラス
        // ofSetColorの引数に渡すと色を変更できる
        // setHsb関数で色相、彩度、明度で色を設定
        ofColor color;
        
        // iは0 ~ 4まで毎フレーム増加する。
        // なので、0,20,40,60,80の値がsetHsbに入る
        color.setHsb(i * 20, 255, 255);
        ofSetColor(color);
        
        // 0, 200, 400, 600, 800の値が入る
        img.draw(i * 200,0);
    }
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
