#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    
    //初期化処理。一度だけ呼ばれる
    
    // 代入。
    posX = 100;
    posY = 100;
    
    rad = 50;
    
    // 背景の色を指定
    ofBackground(0);
}

//--------------------------------------------------------------
void ofApp::update(){
    
    // updateは毎フレーム呼ばれる
    // 描画処理以外を記述する
    // 毎フレーム値に１ずつ数を増やす
    posX = posX + 10;
    
    // 条件式 posXが画面の右端より大きい値になった場合、値を0にする
    if(posX > ofGetWidth()){
        posX = 0;
    }
}

//--------------------------------------------------------------
void ofApp::draw(){
    
    //ここに描画処理を描く。
    //毎フレーム呼ばれる
    
    // 円の色を指定
    ofSetColor(255,0,0);
    // 円を描く命令
    ofDrawCircle(posX, posY, rad);
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
